# 下标又称之为索引，表示第几个数据

# 可迭代对象：  str  list  tuple  dict  set  range  都可以遍历
# str tuple list可以通过下标来获取或操作数据

# 在计算机里，下标从 0 开始
word = 'zhangsan'
# 可以通过下标来获取或修改指定位置的数据
print(word[4])

# 字符串是不可变的数据类型
# 对于字符串的任何操作，都不会改变原有字符串！！！
# word[4] = x  报错

# 切片就是从字符串里复制一段指定内容，生成一个新的字符串
m = 'abcdefghijklmnopqrstuvwxyz'
print(m[5])  # m[index]获取指定下标上的数据
# 切片语法 m[start:end:step]
# 包含start，不包含end
# step 指步长（或间隔）,每隔 (step-1) 个取一次
# step 为复数，表示从右往左获取
print(m[2:9])
print(m[2:])
print(m[:9])

# 步长默认为 1
print(m[3:15:2])
# print(m[3:15:0])  #步长不能为 0
print('-------------------------------------------------')
print(m[3:15:-1])  # 没有数据
print(m[15:3:-1])  # 倒着复制
print(m[::])
print(m[::-1])  # 倒着复制
print('-------------------------------------------------')
print(m[-5:-9])
print('-------------------------------------------------')
print(m[-9:-5])  # start和end为负数，表示从右边数
